{
  "metadata": {
    "stage": "1B",
    "company": "Block, Inc.",
    "extraction_date": "2026-02-28",
    "sources_analyzed": ["S-008", "S-009", "S-010", "S-011", "S-012", "S-013", "S-014", "S-017", "S-018", "S-019", "S-020"],
    "methodology": "Manual extraction from action-type sources per prompts/01_gather_actions.md. Web search and web fetch used to retrieve source content; raw text saved to data/raw/block_actions_{source_id}.txt. Evidence extracted across five categories: capital allocation, organizational decisions, product/service launches, discontinued initiatives, and segment financial results.",
    "source_hierarchy": "Regulatory filings > Earnings transcripts > Press releases > Third-party",
    "limitations": "Full-text earnings call transcripts (S-010 through S-014) were not fully accessible behind paywalls; extraction relied on publicly available summaries, highlights, and partial transcript content from Motley Fool, Seeking Alpha, Yahoo Finance, and Investing.com. The FY 2025 10-K (S-006) was filed February 26, 2026, and full-text indexing may be incomplete. TBD/Web5 shutdown and TIDAL scale-back (November 2024) predate the primary analysis window but are included as they represent strategic pivots relevant to drift analysis. Some Q1 and Q2 2025 data is based on earnings summaries rather than SEC filings directly."
  },
  "actions": [
    {
      "id": "ACT-001",
      "type": "organizational_decision",
      "description": "Block announced a workforce reduction restructuring plan, cutting more than 40% of its workforce from over 10,000 to under 6,000 employees. Expected restructuring charges of $450-$500 million, primarily in Q1 2026, with execution substantially complete by end of Q2 2026. CEO Dorsey framed this as an AI-native transformation: 'Intelligence tools have changed what it means to build and run a company.'",
      "magnitude": "high",
      "date": "2026-02-26",
      "source_id": "S-009",
      "source_bias": "regulatory-filing",
      "implied_strategic_area": "AI-native operating model / cost discipline / organizational transformation",
      "confidence": 0.98,
      "notes": "8-K filing (S-009) is primary source with legal liability. Corroborated by Q4 2025 earnings call (S-010), press release (S-018), and extensive third-party reporting (CNBC S-024, TechCrunch, CNN, Axios). Stock surged 24% on announcement. Follows earlier 930-person layoff in March 2025. This is the single largest organizational action in Block's history."
    },
    {
      "id": "ACT-002",
      "type": "capital_allocation",
      "description": "Block repurchased $2.3 billion in shares during FY 2025, including $790 million (11.9 million Class A shares) in Q4 2025 alone. The board authorized a $5 billion increase to the share repurchase program at Investor Day (November 2025), raising total authorization to $9 billion, with $5.3 billion remaining at year-end 2025. Management expressed intent to maintain ~$2.3B annual repurchase pace.",
      "magnitude": "high",
      "date": "2025-Q4",
      "source_id": "S-018",
      "source_bias": "company-produced",
      "implied_strategic_area": "Capital returns / shareholder value / excess capital deployment",
      "confidence": 0.95,
      "notes": "Q4 earnings press release (S-018) and earnings call (S-010) provide primary data. $5B authorization increase from Investor Day press release (S-003). Total liquidity of $9.2B at year-end supports continued buyback capacity. Signals management preference for capital returns over large-scale M&A."
    },
    {
      "id": "ACT-003",
      "type": "product_launch",
      "description": "Block unveiled Proto Rig, a modular bitcoin mining system delivering 819 TH/s, and Proto Fleet, free open-source fleet management software. Proto Rig's modular design enables 10-year hardware lifecycle (vs. industry standard 3-5 years) with 15-20% cost reduction per upgrade cycle and 1.5x power density. Launched in partnership with Core Scientific at their Dalton, GA facility.",
      "magnitude": "medium",
      "date": "2025-08-14",
      "source_id": "S-017",
      "source_bias": "company-produced",
      "implied_strategic_area": "Bitcoin ecosystem / mining hardware / vertical integration",
      "confidence": 0.90,
      "notes": "BusinessWire press release (S-017) is primary. Corroborated by Bitcoin Magazine, Nasdaq, CrowdFund Insider. Proto Rigs were confirmed contributing to Q4 2025 results per earnings call (S-010). Targets Bitmain's ~80% market share. First end-to-end product from Proto division, following initial chip sale to Core Scientific. Revenue/margin contribution not yet separately disclosed."
    },
    {
      "id": "ACT-004",
      "type": "product_launch",
      "description": "Block launched Cash App Green, a primary banking benefits program, in November 2025. Benefits include 3.5% APY on savings, higher Borrow limits (up to $400 for first-time borrowers), free overdraft coverage up to $200, priority phone support, free in-network ATM withdrawals, and five customized weekly offers. Over 8 million actives eligible for Green status. Personalized offers attach rate grew from 2% to 14%.",
      "magnitude": "medium",
      "date": "2025-11-13",
      "source_id": "S-010",
      "source_bias": "company-produced",
      "implied_strategic_area": "Cash App banking deepening / user monetization / primary banking",
      "confidence": 0.92,
      "notes": "Earnings call (S-010) and Cash App press event coverage are primary sources. Corroborated by American Banker, Yahoo Finance, TechCrunch. The 2%→14% attach rate growth for personalized offers is a key engagement metric. 9.3M primary banking actives (+22% YoY) demonstrate traction. Cash App Green is central to Block's strategy of converting transacting users into primary banking customers."
    },
    {
      "id": "ACT-005",
      "type": "product_launch",
      "description": "Cash App began rollout of Afterpay's Pay Over Time products at hundreds of thousands of online merchants, rebranded as 'Cash App Afterpay.' Additionally, Afterpay on Cash App Card pilot announced for in-store BNPL anywhere Visa is accepted (via Visa Debit Flex Card). Pay in 4 for peer-to-peer payments launched in February 2026, described as an 'industry first.' Afterpay pre-purchase also launched February 2026.",
      "magnitude": "medium",
      "date": "2025-Q2",
      "source_id": "S-012",
      "source_bias": "company-produced",
      "implied_strategic_area": "Afterpay-Cash App integration / BNPL ecosystem / lending growth",
      "confidence": 0.88,
      "notes": "Multiple sources: Q2 earnings call (S-012), investors.block.xyz press releases, American Banker, Payments Dive. Integration rolled out progressively through 2025. The Cash App Card Afterpay pilot announced for larger rollout in early 2026. P2P BNPL (Pay in 4) confirmed as industry first in Q4 2025 earnings call (S-010). This is a multi-quarter execution rather than single-date launch."
    },
    {
      "id": "ACT-006",
      "type": "product_launch",
      "description": "Block launched Square Handheld (May 2025), a pocketable 11 oz POS device that is IP54-rated, and the second-generation Square Register (February 2026) running 40% faster than predecessor. Square Handheld subsequently expanded to the UK for restaurant market. These address upmarket and complex-operation seller segments.",
      "magnitude": "low",
      "date": "2025-05-13",
      "source_id": "S-018",
      "source_bias": "company-produced",
      "implied_strategic_area": "Square hardware ecosystem / upmarket seller expansion / international",
      "confidence": 0.90,
      "notes": "Press releases from investors.block.xyz and BusinessWire. Earnings call (S-010) noted hardware costs represent 2pp headwind to Square gross profit growth. UK expansion for Square Handheld shows international ambitions. These are incremental product launches rather than transformative strategic moves, but they support the Square growth narrative."
    },
    {
      "id": "ACT-007",
      "type": "product_launch",
      "description": "Block surpassed $200 billion in cumulative credit provided to customers across Cash App Borrow, Afterpay, and Square Loans. Square Financial Services (SFS), Block's in-house bank, originated more than $20 billion since inception. In 2025, SFS began originating all Cash App Borrow loans directly. Block completed a Cash App Score pilot, with plans to offer it to third-party lenders.",
      "magnitude": "high",
      "date": "2026-01-20",
      "source_id": "S-019",
      "source_bias": "company-produced",
      "implied_strategic_area": "Lending ecosystem / financial services deepening / Cash App monetization",
      "confidence": 0.90,
      "notes": "Press release (S-019) from block.xyz and BusinessWire. Corroborated by Morningstar, Yahoo Finance. Q4 2025 earnings (S-010) provide supporting growth data: consumer lending +69% YoY, Borrow originations +223% YoY. Stable loss rates since 2013 is a key risk management claim. Cash App Score as potential external product represents new revenue opportunity. SFS in-house origination gives Block more underwriting control."
    },
    {
      "id": "ACT-008",
      "type": "discontinued_initiative",
      "description": "Block shut down TBD, its decentralized internet (Web5) and tbDEX division, in November 2024. The company simultaneously announced it was 'scaling back investment in TIDAL,' its music streaming service acquired in 2021. Resources were redirected to Bitcoin mining (Proto) and Bitkey self-custody wallet. TIDAL had previously taken a $132.3 million goodwill impairment charge in FY2023.",
      "magnitude": "medium",
      "date": "2024-11-07",
      "source_id": "S-014",
      "source_bias": "company-produced",
      "implied_strategic_area": "Portfolio rationalization / Bitcoin focus / strategic exit from non-core",
      "confidence": 0.95,
      "notes": "CNBC, TechCrunch, CoinDesk, and The Block all reported the shutdown. Confirmed in Q4 2024 earnings call (S-014). TBD employees laid off; Web5 and tbDEX never reached significant product-market fit. TIDAL revenue fell from $58M (Q3 2021) to $44M (Q3 2024). The $132.3M TIDAL impairment charge signals significant overpayment for the 2021 acquisition. This action directly supports the Bitcoin-first resource reallocation thesis."
    },
    {
      "id": "ACT-009",
      "type": "organizational_decision",
      "description": "Block joined the S&P 500 index effective July 23, 2025, replacing Hess Corp (acquired by Chevron). This triggered automatic institutional buying from index-tracking funds, with Block's stock rising approximately 8.5-10% on the announcement.",
      "magnitude": "medium",
      "date": "2025-07-23",
      "source_id": "S-018",
      "source_bias": "company-produced",
      "implied_strategic_area": "Corporate maturation / institutional recognition / market credibility",
      "confidence": 0.98,
      "notes": "S&P Global press release and Bloomberg reporting. Not an action Block directly controlled, but reflects recognition of sufficient market cap, profitability, and public float. Fortune (S-025) covered this as 'Dorsey's Mainstream Dream.' Relevant to drift analysis as it signals transition from growth-stage fintech to established financial services company."
    },
    {
      "id": "ACT-010",
      "type": "organizational_decision",
      "description": "Block laid off approximately 930 employees in March 2025 as a reorganization step. This preceded the much larger 40%+ workforce reduction announced in February 2026 (ACT-001) and represented an earlier phase of the efficiency and AI-native transformation push.",
      "magnitude": "medium",
      "date": "2025-03",
      "source_id": "S-013",
      "source_bias": "company-produced",
      "implied_strategic_area": "Cost discipline / organizational efficiency / pre-cursor to AI-native pivot",
      "confidence": 0.85,
      "notes": "Referenced in Q1 2025 earnings call (S-013) and third-party coverage. Less detail available than for the larger February 2026 cut. The Block reported it as a step toward 'increasing the company's stock value.' This establishes a pattern of progressive workforce reduction across 2024-2026."
    },
    {
      "id": "ACT-011",
      "type": "segment_financial_result",
      "description": "Cash App segment: Q4 2025 gross profit $1.83B (+33% YoY), Q3 $2.66B aggregate (Cash App portion ~24% YoY growth), Q2 $1.50B (+16% YoY), Q1 ~10% YoY growth. Full-year 2025 showed clear acceleration pattern from 10% in Q1 to 33% in Q4. Monthly actives reached 59 million. Primary banking actives grew to 9.3 million (+22% YoY). Consumer lending originations +50% full-year, +69% in Q4.",
      "magnitude": "high",
      "date": "2025-Q4",
      "source_id": "S-010",
      "source_bias": "company-produced",
      "implied_strategic_area": "Cash App growth acceleration / banking deepening / lending scale",
      "confidence": 0.93,
      "notes": "Earnings calls (S-010 through S-013) and press releases (S-018) provide quarterly progression. The Q1-to-Q4 acceleration (10%→16%→24%→33%) validates management's H2 acceleration thesis from Q1 2025. Cash App Green launch (November 2025) appears to have catalyzed Q4 acceleration. Borrow originations +223% YoY in Q4 is particularly notable. Higher losses on new borrower cohorts noted as risk."
    },
    {
      "id": "ACT-012",
      "type": "segment_financial_result",
      "description": "Square segment: Q4 2025 GPV growth 10.3%, Q3 GPV +12% YoY, Q2 GPV +10% YoY, full-year GPV growth 10% (up from 8.6% in 2024). New Volume Added grew 17% full-year, 29% YoY in Q4 (record). Sales-led NVA +62% YoY. Over 100 ISO partners. International GPV grew 25-26% YoY. Square processed $250B GPV from 4.5M+ sellers in FY2025. Hardware/processing costs represented 2pp headwind each to gross profit growth.",
      "magnitude": "high",
      "date": "2025-Q4",
      "source_id": "S-010",
      "source_bias": "company-produced",
      "implied_strategic_area": "Square growth re-acceleration / upmarket expansion / international",
      "confidence": 0.93,
      "notes": "Earnings calls (S-010 through S-014) provide quarterly GPV and gross profit progression. GPV growth improved from 8.6% (FY2024) to 10% (FY2025). NVA metrics show new seller acquisition strength. Sales-led NVA (+62%) indicates successful upmarket push. Q1 2026 GPV QTD over 12% (as of Feb 24) suggests continued acceleration. Hardware cost headwinds (Square Handheld, Register 2.0) are temporary."
    },
    {
      "id": "ACT-013",
      "type": "segment_financial_result",
      "description": "Full-year 2025 consolidated: gross profit $10.36B (+17% YoY), revenue $24.19B (+0.3% YoY). Q4 2025: gross profit $2.87B (+24% YoY), revenue $6.25B (+3.65% YoY). Adjusted operating income improved from ~$466M (Q1) to $588M (Q4). Full-year adjusted operating income approximately $2.07B. Adjusted EBITDA $930M in Q4. Total liquidity $9.2B at year-end.",
      "magnitude": "high",
      "date": "2025-Q4",
      "source_id": "S-018",
      "source_bias": "company-produced",
      "implied_strategic_area": "Operating leverage / profitability / financial health",
      "confidence": 0.95,
      "notes": "Q4 2025 earnings press release (S-018) is primary. Corroborated by 10-K filing (S-006) and earnings call (S-010). The divergence between gross profit growth (+17%) and revenue growth (+0.3%) reflects Bitcoin pass-through revenue dynamics. Gross profit is the more meaningful metric for Block's business. Quarterly progression shows consistent improvement throughout 2025. Guidance for 2026 projects further margin expansion."
    },
    {
      "id": "ACT-014",
      "type": "segment_financial_result",
      "description": "Bitcoin ecosystem: Block held 8,883 BTC on treasury (valued at ~$777.5M at year-end 2025). Cash App enabled ~$58B in Bitcoin buys/sells in Q2 alone. Proto mining rigs began contributing to Q4 2025 results. Bitcoin payments on Square announced for H2 2025 rollout, reaching all eligible sellers in 2026. Bitkey self-custody wallet expanded with inheritance feature and privacy enhancements.",
      "magnitude": "medium",
      "date": "2025-Q4",
      "source_id": "S-018",
      "source_bias": "company-produced",
      "implied_strategic_area": "Bitcoin ecosystem / treasury strategy / mining revenue",
      "confidence": 0.85,
      "notes": "Multiple sources: 10-K (S-006) for Bitcoin treasury, earnings call (S-010) for Proto mining contribution, press releases for Bitkey updates. Bitcoin segment financials not separately broken out in available data. Proto mining revenue contribution appears small relative to Cash App and Square but represents a growing strategic commitment. Bitcoin payments on Square would create a closed-loop Bitcoin commerce ecosystem."
    },
    {
      "id": "ACT-015",
      "type": "capital_allocation",
      "description": "Block incurred restructuring charges of $450-$500 million related to the 40%+ workforce reduction, primarily consisting of cash expenditures for employee severance and benefits. The majority of charges are expected in Q1 2026. This represents the largest single capital deployment for organizational restructuring in Block's history.",
      "magnitude": "high",
      "date": "2026-Q1",
      "source_id": "S-009",
      "source_bias": "regulatory-filing",
      "implied_strategic_area": "Restructuring investment / one-time cost for operating model transformation",
      "confidence": 0.97,
      "notes": "8-K filing (S-009) is authoritative source with SEC legal liability. Charges represent approximately 4.3-4.8% of full-year 2025 gross profit, or roughly one quarter of full-year adjusted operating income. These are one-time costs expected to generate significantly higher recurring operating income in 2026 and beyond. The $3.2B 2026 adjusted operating income guidance implies the restructuring savings will more than offset charges."
    },
    {
      "id": "ACT-016",
      "type": "product_launch",
      "description": "Block processed 124 million transactions across Square, Cash App, and Afterpay during BFCM 2025 (November 29 - December 2), a 10% increase from 2024. Engaged 49.8 million unique consumers and served over 1.3 million businesses. Gift card spend reached $33.5 million. Demonstrates cross-platform integration across Square (sellers), Cash App (consumers), and Afterpay (BNPL).",
      "magnitude": "low",
      "date": "2025-12-02",
      "source_id": "S-020",
      "source_bias": "company-produced",
      "implied_strategic_area": "Commerce ecosystem integration / cross-platform synergy / seasonal execution",
      "confidence": 0.88,
      "notes": "Press release (S-020) from squareup.com and investors.block.xyz. Marketing-oriented framing should be noted — BFCM releases are designed to highlight positive metrics. However, the 10% YoY growth and 49.8M unique consumers are concrete data points. Cross-platform integration (Square + Cash App + Afterpay) is a key strategic thesis for Block's ecosystem value."
    },
    {
      "id": "ACT-017",
      "type": "product_launch",
      "description": "Bitkey, Block's self-custody bitcoin wallet, expanded features in 2025: inheritance feature for legacy bitcoin transfers (launched early 2025), transaction verification software, fingerprint reset, private wallet balances, private purchasing (pick up at physical locations or buy with Bitcoin). Block also announced bitcoin payments on Square with rollout beginning H2 2025.",
      "magnitude": "low",
      "date": "2025-02-26",
      "source_id": "S-017",
      "source_bias": "company-produced",
      "implied_strategic_area": "Bitcoin ecosystem / self-custody / consumer Bitcoin adoption",
      "confidence": 0.82,
      "notes": "Multiple press releases from block.xyz and BusinessWire. Bitkey was one of two products (with Proto) that received redirected investment after TBD shutdown. Revenue contribution not disclosed separately. The bitcoin payments on Square announcement would create a closed-loop Bitcoin commerce system if fully executed. Inheritance feature addresses a known gap in crypto self-custody."
    },
    {
      "id": "ACT-018",
      "type": "capital_allocation",
      "description": "Block's transaction, loan, and risk loss expenses grew 89% YoY in Q3 2025, reflecting the company's investment in scaling lending products. Consumer lending originations grew 50% for full-year 2025, with Borrow originations up 223% YoY in Q4. Management acknowledged higher portfolio losses in December/January from 'record first-time Borrow actives' but noted mid-February cohorts trending below loss targets.",
      "magnitude": "high",
      "date": "2025-Q3",
      "source_id": "S-011",
      "source_bias": "company-produced",
      "implied_strategic_area": "Lending investment / credit risk / financial services growth engine",
      "confidence": 0.90,
      "notes": "Q3 earnings call (S-011) for 89% loss expense growth. Q4 earnings call (S-010) for lending origination data and loss commentary. The 89% loss expense growth rate significantly exceeds revenue/gross profit growth, indicating an intentional investment phase. Management framed higher losses as 'by design' for new borrower acquisition. This represents a key risk area to monitor — if losses exceed targets, it could indicate credit quality deterioration."
    }
  ]
}
