{
  "metadata": {
    "stage": "1C",
    "company": "Block, Inc.",
    "extraction_date": "2026-02-28",
    "sources_analyzed": ["S-001", "S-002", "S-003", "S-010", "S-011", "S-012", "S-013", "S-014"],
    "methodology": "Manual extraction from forward-looking statements per prompts/01_gather_commitments.md. Earnings call transcripts, shareholder letters, investor day materials, and press releases were analyzed for guidance statements, verbal commitments, timeline promises, and comparative framing. Q&A responses weighted higher than prepared remarks per methodology.",
    "qa_weighting": "Q&A responses weighted higher than prepared remarks per methodology. Analyst follow-up questions given highest weight. Prepared remarks treated as curated messaging — reliable for intent but may omit inconvenient details.",
    "limitations": "Full-text earnings call transcripts were not fully accessible behind paywalls; extraction relied on publicly available summaries and highlights. The Q4 2025 shareholder letter (S-001) was not available as full PDF; commitments extracted from coverage and summarized quotes. Some earlier commitments (Q1-Q2 2025) have less detailed Q&A data available. Forward-looking statements carry safe harbor disclaimers. Investor Day 2025 multi-year targets through 2028 cannot yet be fully assessed for fulfillment as timelines extend beyond current date."
  },
  "commitments": [
    {
      "id": "CMT-001",
      "statement": "Block expects 2026 gross profit of $12.20 billion, up 18% year over year.",
      "speaker": "Amrita Ahuja, COO/CFO",
      "type": "guidance",
      "context": "shareholder_letter",
      "date": "2026-02-26",
      "source_id": "S-001",
      "source_bias": "company-produced",
      "specificity": "quantitative",
      "status": "in_progress",
      "status_evidence": "Guidance issued February 26, 2026; timeline is forward-looking for full year 2026. This target was raised from the Investor Day (November 2025) target of $11.98B, reflecting confidence from strong Q4 2025 results ($2.87B, +24% YoY). Achievement depends on sustained ~18% growth through 2026.",
      "notes": "This is the most current 2026 gross profit guidance, superseding the Investor Day target. Raised by $220M (~1.8%) within 3 months of initial setting. Q1 2026 sub-guidance of $2.80B (+22% YoY) implies front-loaded confidence."
    },
    {
      "id": "CMT-002",
      "statement": "Block expects 2026 adjusted operating income of $3.20 billion, representing a 26% margin and 54% year-over-year growth.",
      "speaker": "Amrita Ahuja, COO/CFO",
      "type": "guidance",
      "context": "shareholder_letter",
      "date": "2026-02-26",
      "source_id": "S-001",
      "source_bias": "company-produced",
      "specificity": "quantitative",
      "status": "in_progress",
      "status_evidence": "Forward-looking for FY 2026. Raised significantly from Investor Day target of $2.70B — a $500M increase (+18.5%) in 3 months, largely driven by the 40%+ workforce reduction. The 26% margin implies 6 points of expansion from 2025's ~20%. Q1 2026 sub-guidance: $600M at 21% margin, with H2 expected to show larger benefits.",
      "notes": "The jump from $2.70B to $3.20B is primarily attributable to the workforce restructuring announced simultaneously. This commitment is tightly linked to ACT-001 (workforce reduction). If restructuring execution is delayed or savings are lower than projected, this target is at risk."
    },
    {
      "id": "CMT-003",
      "statement": "Block expects 2026 adjusted diluted EPS of $3.66, representing 54% year-over-year growth. Q1 2026 EPS expected at $0.67 (+920% YoY).",
      "speaker": "Amrita Ahuja, COO/CFO",
      "type": "guidance",
      "context": "shareholder_letter",
      "date": "2026-02-26",
      "source_id": "S-001",
      "source_bias": "company-produced",
      "specificity": "quantitative",
      "status": "in_progress",
      "status_evidence": "Forward-looking for FY 2026. Raised from Investor Day target of $3.20 to $3.66. Morgan Stanley's independent projection of $3.81 EPS for 2026 (S-021) suggests some analysts see upside to even the raised guidance. The Q1 +920% YoY comparison reflects a very low Q1 2025 base.",
      "notes": "The 920% Q1 YoY comparison is somewhat misleading due to a low base (Q1 2025 adjusted EPS was suppressed by weak results). More meaningful is the full-year 54% growth rate. This exceeds the Investor Day commitment of 30% annual EPS growth, suggesting the workforce cuts created a step-function improvement."
    },
    {
      "id": "CMT-004",
      "statement": "Block expects gross profit to grow in the mid-teens range annually through 2028, reaching approximately $15.8 billion.",
      "speaker": "Amrita Ahuja, COO/CFO",
      "type": "guidance",
      "context": "press_release",
      "date": "2025-11-19",
      "source_id": "S-002",
      "source_bias": "company-produced",
      "specificity": "quantitative",
      "status": "in_progress",
      "status_evidence": "Three-year outlook through 2028. FY 2025 actual gross profit of $10.36B provides the base. Mid-teens growth annually from $10.36B implies ~$12.0B (2026), ~$13.8B (2027), ~$15.8B (2028). The 2026 target has already been raised to $12.2B (above the mid-teens trajectory), suggesting the path is on track or ahead of schedule.",
      "notes": "Issued at Investor Day November 2025. The 2026 raised guidance ($12.2B = +18%) slightly exceeds mid-teens (15-17%), which is a positive signal for the multi-year trajectory. However, 2027 and 2028 targets depend on sustained execution and market conditions beyond current visibility."
    },
    {
      "id": "CMT-005",
      "statement": "Block expects adjusted operating income to grow about 30% annually through 2028, reaching $4.6 billion.",
      "speaker": "Amrita Ahuja, COO/CFO",
      "type": "guidance",
      "context": "press_release",
      "date": "2025-11-19",
      "source_id": "S-002",
      "source_bias": "company-produced",
      "specificity": "quantitative",
      "status": "in_progress",
      "status_evidence": "Three-year outlook. FY 2025 adjusted operating income was ~$2.07B. Investor Day 2026 target was $2.70B (30% growth). However, Q4 2025 raised 2026 to $3.20B (+54%), significantly front-loading the trajectory. If $3.20B is the new 2026 base, 30% annual growth implies ~$4.16B (2027) and ~$5.4B (2028) — above the $4.6B 2028 target. The workforce reduction has effectively accelerated the operating income trajectory beyond original Investor Day projections.",
      "notes": "The 2028 target of $4.6B may prove conservative given the workforce restructuring's impact on the 2026 base. The Investor Day trajectory was set before the 40%+ workforce cut was announced. Management may update the multi-year outlook at a future event."
    },
    {
      "id": "CMT-006",
      "statement": "Block expects adjusted earnings per share to grow in the low 30% range annually through 2028 to $5.50.",
      "speaker": "Amrita Ahuja, COO/CFO",
      "type": "guidance",
      "context": "press_release",
      "date": "2025-11-19",
      "source_id": "S-002",
      "source_bias": "company-produced",
      "specificity": "quantitative",
      "status": "in_progress",
      "status_evidence": "Three-year outlook. 2026 EPS now guided at $3.66 (raised from $3.20), already exceeding the 30% annual growth path. From $3.66 base, 30% growth implies ~$4.76 (2027) and ~$6.18 (2028) — well above the $5.50 2028 target. Like operating income, the EPS trajectory appears to have been pulled forward by the restructuring.",
      "notes": "The $5.50 2028 target was set before the workforce restructuring. This target may need to be revised upward at the next Investor Day or annual guidance update."
    },
    {
      "id": "CMT-007",
      "statement": "Block expects to achieve Rule of 40 in 2026 and sustain through 2028.",
      "speaker": "Amrita Ahuja, COO/CFO",
      "type": "guidance",
      "context": "press_release",
      "date": "2025-11-19",
      "source_id": "S-002",
      "source_bias": "company-produced",
      "specificity": "time_bound",
      "status": "in_progress",
      "status_evidence": "Rule of 40 = gross profit growth rate + adjusted operating income margin >= 40. For 2026: 18% growth + 26% margin = 44. This exceeds the Rule of 40 threshold, suggesting the commitment will be fulfilled if guidance is met. The workforce restructuring makes this significantly more achievable by expanding margins.",
      "notes": "Rule of 40 is a well-known tech company benchmark. Based on current 2026 guidance (18% growth + 26% margin = 44), Block would already exceed it. The commitment to sustain through 2028 depends on maintaining growth rates as the base scales."
    },
    {
      "id": "CMT-008",
      "statement": "Block expects non-GAAP cash flow to reach 25% of gross profit by 2028, totaling more than $4.0 billion. For 2026, expects 20% of gross profit or $2.40 billion.",
      "speaker": "Amrita Ahuja, COO/CFO",
      "type": "guidance",
      "context": "press_release",
      "date": "2025-11-19",
      "source_id": "S-002",
      "source_bias": "company-produced",
      "specificity": "quantitative",
      "status": "in_progress",
      "status_evidence": "Non-GAAP cash flow is a new metric introduced at Investor Day 2025 that accounts for capital required to grow lending products. The 2026 target of $2.40B (20% of $11.98B Investor Day GP) may be adjusted given raised GP guidance to $12.2B, which would imply $2.44B at 20%. Cannot assess until FY 2026 reporting.",
      "notes": "This is a company-defined non-GAAP metric, making independent verification more challenging. The metric is designed to show cash generation after accounting for lending capital — important because lending growth requires balance sheet investment that traditional EBITDA does not capture."
    },
    {
      "id": "CMT-009",
      "statement": "Block's board authorized a $5 billion increase to its share repurchase program, raising total authorization to $9 billion. Management intends to maintain approximately $2.3 billion in annual repurchases.",
      "speaker": "Amrita Ahuja, COO/CFO",
      "type": "verbal_commitment",
      "context": "press_release",
      "date": "2025-11-19",
      "source_id": "S-003",
      "source_bias": "company-produced",
      "specificity": "quantitative",
      "status": "partially_fulfilled",
      "status_evidence": "The $5B authorization increase is confirmed. In FY 2025, Block repurchased $2.3B in shares, fulfilling the annual pace commitment for 2025. $5.3B remains under authorization at year-end 2025. The commitment to maintain ~$2.3B annual pace through 2026+ is in progress. Partially fulfilled because 2025 execution is complete but 2026+ is forward-looking.",
      "notes": "The buyback commitment signals management's confidence in cash generation and preference for capital returns over M&A. At ~$2.3B annually and $5.3B remaining, the current authorization covers approximately 2.3 years of buybacks at the stated pace."
    },
    {
      "id": "CMT-010",
      "statement": "Intelligence tools have changed what it means to build and run a company. A significantly smaller team, using the tools we're building, can do more and do it better. Intelligence tool capabilities are compounding faster every week.",
      "speaker": "Jack Dorsey, CEO",
      "type": "verbal_commitment",
      "context": "shareholder_letter",
      "date": "2026-02-26",
      "source_id": "S-001",
      "source_bias": "company-produced",
      "specificity": "directional",
      "status": "in_progress",
      "status_evidence": "The workforce reduction (10,000+ to <6,000) is the concrete action backing this commitment. Dorsey cited 'production code shipped per engineer increased by over 40% since September' as evidence of AI productivity gains. However, actual long-term productivity outcomes remain to be proven. The restructuring is expected to be substantially complete by end of Q2 2026.",
      "notes": "This is Dorsey's core thesis for the restructuring. The 40%+ code-per-engineer metric is the primary quantitative backing. However, code shipped per engineer is an input metric — output quality, product velocity, and customer impact are better measures of whether the AI-native model works. This commitment carries significant execution risk: if remaining employees are overburdened or institutional knowledge is lost, the thesis could fail."
    },
    {
      "id": "CMT-011",
      "statement": "Within the next year, I believe the majority of companies will reach the same conclusion and make similar structural changes.",
      "speaker": "Jack Dorsey, CEO",
      "type": "verbal_commitment",
      "context": "shareholder_letter",
      "date": "2026-02-26",
      "source_id": "S-001",
      "source_bias": "company-produced",
      "specificity": "aspirational",
      "status": "cannot_assess",
      "status_evidence": "This is a prediction about the broader economy rather than a commitment about Block's own actions. It is aspirational framing to position Block as a leader rather than an outlier. Some large companies (Amazon, eBay per Axios reporting) have made similar cuts, but 'majority of companies' within one year is a very aggressive claim.",
      "notes": "This statement serves a narrative purpose — it frames Block's cuts as visionary rather than reactive. It also provides cover if the restructuring causes operational problems: Dorsey can argue the industry is moving this way regardless. Low accountability — there is no specific metric by which to evaluate 'majority of companies.'"
    },
    {
      "id": "CMT-012",
      "statement": "Block expects the workforce reduction execution to be substantially complete by the end of Q2 2026, with the majority of $450-$500 million in restructuring charges incurred in Q1 2026.",
      "speaker": "Amrita Ahuja, COO/CFO",
      "type": "timeline_promise",
      "context": "shareholder_letter",
      "date": "2026-02-26",
      "source_id": "S-009",
      "source_bias": "regulatory-filing",
      "specificity": "time_bound",
      "status": "in_progress",
      "status_evidence": "8-K filing establishes legally binding disclosure of timeline and charges. As of February 28, 2026, the restructuring has been announced but Q1 is not yet complete. Cannot fully assess until Q2 2026 reporting. The dollar range ($450-$500M) is specific enough to evaluate against actual charges when reported.",
      "notes": "This is sourced from the 8-K filing (S-009), which carries SEC legal liability and is the highest-reliability source for this commitment. The timeline is tight (substantially complete in ~4 months). Execution risk includes potential delays in international markets, legal challenges, or operational disruption."
    },
    {
      "id": "CMT-013",
      "statement": "Block expects the majority of operating income benefits from the restructuring to appear in H2 2026.",
      "speaker": "Amrita Ahuja, COO/CFO",
      "type": "timeline_promise",
      "context": "qa_response",
      "date": "2026-02-27",
      "source_id": "S-010",
      "source_bias": "company-produced",
      "specificity": "time_bound",
      "status": "in_progress",
      "status_evidence": "Stated during Q4 2025 earnings call Q&A. The Q1 2026 guidance of $600M adjusted operating income (21% margin) is below the full-year implied quarterly run-rate of $800M (26% margin), consistent with H2 benefit loading. This is logically consistent with the Q2 restructuring completion timeline (CMT-012).",
      "notes": "From Q&A section — higher weight per methodology. This timeline implies Q3-Q4 2026 operating margins should be materially higher than Q1-Q2. If Q3 2026 does not show margin expansion, the commitment may be at risk."
    },
    {
      "id": "CMT-014",
      "statement": "Block expects to roll out bitcoin payments on Square beginning in H2 2025, reaching all eligible Square sellers in 2026, with no processing fees until 2027.",
      "speaker": "Jack Dorsey, CEO (announced at Bitcoin 2025 conference)",
      "type": "timeline_promise",
      "context": "press_release",
      "date": "2025-05-27",
      "source_id": "S-017",
      "source_bias": "company-produced",
      "specificity": "time_bound",
      "status": "in_progress",
      "status_evidence": "Announced May 2025 at Bitcoin conference. The Q4 2025 earnings call confirmed bitcoin payments on Square anticipated for H2 rollout. The commitment to reach 'all eligible Square sellers' in 2026 is in progress. The no-processing-fees-until-2027 commitment establishes a specific monetization timeline. Subject to regulatory approvals; not available in New York or outside US.",
      "notes": "This is a multi-component commitment: (1) begin H2 2025, (2) all eligible sellers by 2026, (3) free until 2027. The 'all eligible sellers' qualifier is important — regulatory and geographic limitations mean not literally every Square merchant. ~4 million Square sellers represents significant potential Bitcoin payment adoption. Lightning Network integration for speed and cost."
    },
    {
      "id": "CMT-015",
      "statement": "Block expects Cash App Borrow loss rate to remain below 3% target. Mid-February 2026 cohorts are trending below targets.",
      "speaker": "Amrita Ahuja, COO/CFO",
      "type": "guidance",
      "context": "qa_response",
      "date": "2026-02-27",
      "source_id": "S-010",
      "source_bias": "company-produced",
      "specificity": "quantitative",
      "status": "in_progress",
      "status_evidence": "From Q4 2025 earnings call Q&A (higher weight). Management acknowledged Dec/Jan losses were elevated due to 'record first-time Borrow actives' with 'higher losses by design,' but mid-February cohorts trending below the 3% target provides a positive signal. Q3 2025 annualized net margin was 24% with losses below 3%. This is an ongoing operational commitment, not a one-time target.",
      "notes": "From Q&A section — higher weight per methodology. The tension between rapid lending growth (+223% Borrow originations YoY in Q4) and maintaining sub-3% loss rates is the key risk to monitor. Management's acknowledgment of higher Dec/Jan losses shows candor. If losses persistently exceed 3%, it could force growth deceleration or impact profitability."
    },
    {
      "id": "CMT-016",
      "statement": "For 2025, Block expects gross profit of at least $10.22 billion (15% YoY growth) and adjusted operating income of $2.1 billion (~21% margin).",
      "speaker": "Amrita Ahuja, CFO",
      "type": "guidance",
      "context": "prepared_remarks",
      "date": "2025-02-21",
      "source_id": "S-014",
      "source_bias": "company-produced",
      "specificity": "quantitative",
      "status": "fulfilled",
      "status_evidence": "Initial 2025 guidance from Q4 2024 earnings call. Actual FY 2025 gross profit: $10.36B (+17% YoY), exceeding the $10.22B target by $140M. Adjusted operating income: ~$2.07B, close to but slightly below $2.1B target (within guidance range). Guidance was raised progressively: Q2 to $10.17B/$2.03B, Q3 to $10.243B/$2.056B. Final results exceeded all raised targets on gross profit.",
      "notes": "This demonstrates Block's pattern of conservative initial guidance followed by progressive raises. The $10.36B actual vs. $10.22B initial represents a 1.4% beat. The operating income came in at approximately $2.07B vs. $2.1B target — very close. The pattern of raising guidance each quarter and then beating it builds credibility for 2026 guidance."
    },
    {
      "id": "CMT-017",
      "statement": "Block expects Square GPV growth to reach high single digits in Q1 2025 (adjusted for leap year and FX), building to low double digits exiting 2025.",
      "speaker": "Amrita Ahuja, CFO",
      "type": "guidance",
      "context": "prepared_remarks",
      "date": "2025-02-21",
      "source_id": "S-014",
      "source_bias": "company-produced",
      "specificity": "quantitative",
      "status": "fulfilled",
      "status_evidence": "Q1 2025 GPV came in at $56.8B (slightly below expectations), but adjusted for leap year and FX was in high single digits as guided. GPV growth accelerated through 2025: Q2 10%, Q3 12%, Q4 10.3%, full year 10%. Q1 2026 QTD over 12%, confirming the 'building to low double digits' trajectory was achieved on a slightly delayed basis.",
      "notes": "The commitment was directionally fulfilled — GPV did reach double digits by late 2025 and into Q1 2026. The Q4 dip to 10.3% from Q3's 12% could be questioned, but the full-year improvement from 8.6% (2024) to 10% (2025) and Q1 2026 QTD >12% validates the trajectory commitment."
    },
    {
      "id": "CMT-018",
      "statement": "Block expects Cash App growth to reaccelerate in H2 2025 through Afterpay integration and expanded lending products, following Q1 softness.",
      "speaker": "Jack Dorsey, CEO / Amrita Ahuja, CFO",
      "type": "verbal_commitment",
      "context": "qa_response",
      "date": "2025-05",
      "source_id": "S-013",
      "source_bias": "company-produced",
      "specificity": "directional",
      "status": "fulfilled",
      "status_evidence": "Cash App gross profit growth trajectory: Q1 ~10% YoY, Q2 16%, Q3 24%, Q4 33%. The reacceleration from 10% in Q1 to 33% in Q4 clearly validates the H2 acceleration commitment. Key drivers as stated: Afterpay integration, Cash App Borrow expansion, and Cash App Green launch (November 2025) all contributed to the acceleration.",
      "notes": "From Q1 2025 earnings Q&A (higher weight). This commitment was made at a moment of weakness (Q1 miss) and represented management's credibility test. The dramatic acceleration from 10% to 33% not only fulfilled the commitment but significantly exceeded expectations. Cash App Green appears to have been the catalyst for the Q4 acceleration."
    },
    {
      "id": "CMT-019",
      "statement": "Block expects to maintain approximately $2.3 billion in annual share repurchases going forward.",
      "speaker": "Amrita Ahuja, COO/CFO",
      "type": "verbal_commitment",
      "context": "qa_response",
      "date": "2026-02-27",
      "source_id": "S-010",
      "source_bias": "company-produced",
      "specificity": "quantitative",
      "status": "in_progress",
      "status_evidence": "FY 2025 repurchases: $2.3B (fulfilled for 2025). $5.3B remaining under $9B authorization. At ~$2.3B annually, remaining authorization covers ~2.3 years. Total liquidity of $9.2B supports continued buybacks. The commitment is for ongoing annual execution.",
      "notes": "From Q&A section — higher weight. This is an implicit commitment that Block's cash generation will support $2.3B+ annual buybacks alongside operating needs and lending capital. If macroeconomic conditions deteriorate or lending losses increase, buyback pace could be reduced."
    },
    {
      "id": "CMT-020",
      "statement": "Block raised Q3 2025 full-year gross profit guidance to $10.243 billion (over 15% YoY) and adjusted operating income to $2.056 billion (~28% YoY growth). Q4 gross profit expected to grow over 19% to $2.755 billion.",
      "speaker": "Amrita Ahuja, COO/CFO",
      "type": "guidance",
      "context": "prepared_remarks",
      "date": "2025-11-06",
      "source_id": "S-011",
      "source_bias": "company-produced",
      "specificity": "quantitative",
      "status": "fulfilled",
      "status_evidence": "Actual FY 2025 gross profit: $10.36B (exceeded $10.243B target by $117M). Actual Q4 2025 gross profit: $2.87B (+24% YoY), significantly exceeding the $2.755B/19% guidance. Full-year adjusted operating income: ~$2.07B (vs. $2.056B target — in line). Q4 outperformance was broad-based: Cash App +33%, Square GPV +10.3%.",
      "notes": "This was the third consecutive quarter of raised guidance being beaten. The Q4 gross profit beat ($2.87B vs. $2.755B, +$115M) was the most significant outperformance of the year, driven by Cash App's 33% growth acceleration."
    },
    {
      "id": "CMT-021",
      "statement": "Block expects Cash App Score to be offered to third-party lenders, creating a new revenue opportunity beyond direct lending.",
      "speaker": "Management (specific speaker not identified)",
      "type": "verbal_commitment",
      "context": "qa_response",
      "date": "2026-02-27",
      "source_id": "S-010",
      "source_bias": "company-produced",
      "specificity": "directional",
      "status": "in_progress",
      "status_evidence": "Pilot completed successfully per the $200B credit milestone press release (S-019, January 2026). Results gave Block 'confidence in expanding access within its lending suite and exploring opportunities for the Cash App Score to help customers qualify for external products.' No specific timeline or revenue targets provided.",
      "notes": "Cash App Score as external product is an early-stage commitment. The pilot completion is a positive signal but commercialization timeline is undefined. If successful, this could represent a new high-margin revenue stream (data licensing/credit scoring) distinct from direct lending."
    },
    {
      "id": "CMT-022",
      "statement": "Block expects the processing cost headwind to Square gross profit (approximately 2 percentage points) to continue until Q2 2026.",
      "speaker": "Amrita Ahuja, COO/CFO",
      "type": "timeline_promise",
      "context": "qa_response",
      "date": "2025-11-06",
      "source_id": "S-011",
      "source_bias": "company-produced",
      "specificity": "time_bound",
      "status": "in_progress",
      "status_evidence": "First disclosed at Q3 2025 earnings (2.6pp headwind). Confirmed at Q4 2025 earnings (2pp headwind each for hardware and processing costs). Timeline of Q2 2026 resolution is consistent across both calls. This reflects Block's processing infrastructure transition.",
      "notes": "From Q&A section — higher weight. This is a negative commitment (acknowledging a headwind) which adds credibility. If the headwind persists beyond Q2 2026, it would suggest structural rather than transitional cost pressure on Square margins."
    },
    {
      "id": "CMT-023",
      "statement": "Block expects to concentrate resources around highest-priority initiatives: Square, Cash App, and the broader ecosystem, while maintaining Bitkey and Proto investments.",
      "speaker": "Jack Dorsey, CEO",
      "type": "verbal_commitment",
      "context": "shareholder_letter",
      "date": "2026-02-26",
      "source_id": "S-001",
      "source_bias": "company-produced",
      "specificity": "directional",
      "status": "in_progress",
      "status_evidence": "The workforce restructuring (ACT-001) and prior portfolio rationalization (TBD shutdown, TIDAL scale-back in November 2024) demonstrate commitment to focus. Square and Cash App both showed growth acceleration in FY 2025. Proto launched with the Proto Rig (ACT-003). Bitkey expanded features. However, the degree of investment in Bitkey and Proto relative to Square and Cash App is not disclosed.",
      "notes": "This is a directional commitment that sets up accountability for strategic focus. The reference to 'broader ecosystem' is deliberately vague — it could encompass Bitcoin, lending, or other initiatives. The key test will be whether resources remain concentrated or diffuse over time."
    },
    {
      "id": "CMT-024",
      "statement": "Block raised Q2 2025 full-year gross profit guidance to $10.17 billion and adjusted operating income to $2.03 billion.",
      "speaker": "Amrita Ahuja, CFO",
      "type": "guidance",
      "context": "prepared_remarks",
      "date": "2025-08-07",
      "source_id": "S-012",
      "source_bias": "company-produced",
      "specificity": "quantitative",
      "status": "fulfilled",
      "status_evidence": "Actual FY 2025: gross profit $10.36B (exceeded $10.17B by $190M), adjusted operating income ~$2.07B (exceeded $2.03B by ~$40M). This was the second consecutive guidance raise, further raised at Q3 to $10.243B/$2.056B, and then beaten by actual results.",
      "notes": "Part of the pattern of progressive guidance raises. Each quarter's raised guidance was subsequently exceeded, building a track record of under-promising and over-delivering."
    }
  ]
}
